       IDENTIFICATION DIVISION.
       PROGRAM-ID. NAME.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT WS-INPUT-FILE ASSIGN TO 'raw_names.txt'
               ORGANIZATION IS LINE SEQUENTIAL.
           SELECT OUTPUT-FILE ASSIGN TO 'clean_names.txt'
               ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.
       FD  WS-INPUT-FILE.
       01  WS-INPUT-RECORD  PIC X(256).

       FD  OUTPUT-FILE.
       01  OUTPUT-RECORD PIC X(256).
    
       WORKING-STORAGE SECTION.

       LINKAGE SECTION.

       PROCEDURE DIVISION.
           GOBACK.
