       IDENTIFICATION DIVISION.
       PROGRAM-ID. STRLEFT.

       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01   WS-INDEX                PIC 9(9) COMP-5.

       LINKAGE SECTION.
       01  LS-STRLEFT-STR1.
           05  LS-STRLEFT-STR1-LEN  PIC 9(4) COMP.
           05  LS-STRLEFT-STR1-BUF  PIC X(256).
       01  LS-STRLEFT-RETURN.
           05  LS-STRLEFT-RETURN-LEN PIC 9(4) COMP.
           05  LS-STRLEFT-RETURN-BUF PIC X(256).
       01   LS-STRLEFT-AMOUNT       PIC 9(9) COMP-5.

       PROCEDURE DIVISION USING LS-STRLEFT-STR1 LS-STRLEFT-AMOUNT
           LS-STRLEFT-RETURN.

           MOVE 1 TO WS-INDEX
           MOVE ALL SPACES TO LS-STRLEFT-RETURN-BUF.

           PERFORM UNTIL WS-INDEX > LS-STRLEFT-AMOUNT OR
           -    WS-INDEX > LS-STRLEFT-STR1-LEN
               MOVE LS-STRLEFT-STR1-BUF(WS-INDEX:1) TO
                   LS-STRLEFT-RETURN-BUF(WS-INDEX:1)
               ADD 1 TO WS-INDEX
           END-PERFORM
           MOVE WS-INDEX TO LS-STRLEFT-RETURN-LEN
           SUBTRACT 1 FROM LS-STRLEFT-RETURN-LEN
           GOBACK.
