       IDENTIFICATION DIVISION.
       PROGRAM-ID. TOLOWER.

       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       LINKAGE SECTION.
       COPY STRING REPLACING ==MY-STRING== BY ==LS-TOLOWER-SRC==
                     ==MY-LEN== BY ==LS-TOLOWER-SRC-LEN==
                     ==MY-BUF== BY ==LS-TOLOWER-SRC-BUF==.

        PROCEDURE DIVISION USING LS-TOLOWER-SRC.
           INSPECT LS-TOLOWER-SRC-BUF(1:LS-TOLOWER-SRC-LEN) CONVERTING
               "ABCDEFGHIJKLMNOPQRSTUVWXYZ" TO
               "abcdefghijklmnopqrstuvwxyz" .
           GOBACK.
