       IDENTIFICATION DIVISION.
       PROGRAM-ID. TOLOWER.

       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       LINKAGE SECTION.
       01  LS-TOLOWER-SRC.
           05  LS-TOLOWER-SRC-LEN PIC 9(4) COMP.
           05  LS-TOLOWER-SRC-BUF PIC X(256).

        PROCEDURE DIVISION USING LS-TOLOWER-SRC.
           INSPECT LS-TOLOWER-SRC-BUF(1:LS-TOLOWER-SRC-LEN) CONVERTING
               "ABCDEFGHIJKLMNOPQRSTUVWXYZ" TO
               "abcdefghijklmnopqrstuvwxyz" .
           GOBACK.