       IDENTIFICATION DIVISION.
       PROGRAM-ID. TOUPPER.

       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       LINKAGE SECTION.
       01   LS-TOUPPER-SRC         PIC X(255).
       01   LS-TOUPPER-LEN         PIC 9(9).

       PROCEDURE DIVISION USING LS-TOUPPER-SRC LS-TOUPPER-LEN.
           INSPECT LS-TOUPPER-SRC(1:LS-TOUPPER-LEN) CONVERTING
               "abcdefghijklmnopqrstuvwxyz" TO
               "ABCDEFGHIJKLMNOPQRSTUVWXYZ".
           GOBACK.
