       IDENTIFICATION DIVISION.
       PROGRAM-ID. TOUPPER.

       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       LINKAGE SECTION.
       COPY STRING REPLACING ==MY-STRING== BY ==LS-TOUPPER-SRC==
                     ==MY-LEN== BY ==LS-TOUPPER-SRC-LEN==
                     ==MY-BUF== BY ==LS-TOUPPER-SRC-BUF==.

       PROCEDURE DIVISION USING LS-TOUPPER-SRC.
           INSPECT LS-TOUPPER-SRC-BUF(1:LS-TOUPPER-SRC-LEN) CONVERTING
               "abcdefghijklmnopqrstuvwxyz" TO
               "ABCDEFGHIJKLMNOPQRSTUVWXYZ".
           GOBACK.
