       IDENTIFICATION DIVISION.
       PROGRAM-ID. TOUPPER.

       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       LINKAGE SECTION.
       01  LS-TOUPPER-SRC.
           05  LS-TOUPPER-SRC-LEN PIC 9(4) COMP.
           05  LS-TOUPPER-SRC-BUF PIC X(256).

       PROCEDURE DIVISION USING LS-TOUPPER-SRC.
           INSPECT LS-TOUPPER-SRC-BUF(1:LS-TOUPPER-SRC-LEN) CONVERTING
               "abcdefghijklmnopqrstuvwxyz" TO
               "ABCDEFGHIJKLMNOPQRSTUVWXYZ".
           GOBACK.