       IDENTIFICATION DIVISION.
       PROGRAM-ID. TOLOWER.

       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       LINKAGE SECTION.
       01   LS-TOLOWER-SRC         PIC X(255).
       01   LS-TOLOWER-LEN         PIC 9(9) COMP-5.

        PROCEDURE DIVISION USING LS-TOLOWER-SRC LS-TOLOWER-LEN.
           INSPECT LS-TOLOWER-SRC(1:LS-TOLOWER-LEN) CONVERTING
               "ABCDEFGHIJKLMNOPQRSTUVWXYZ" TO
               "abcdefghijklmnopqrstuvwxyz" .
           GOBACK.
